[VCP_Hacker X2EncyclopediaTemplate]
ListTitle = "黑客"
DescriptionTitle = "黑客"
DescriptionEntry = "这些士兵经过训练，能在各种不利条件下准确击中目标，他们擅长在安全距离外击败难以击中或防守严密的目标。他们拥有多种不同的方法来消灭高价值目标!"

[VCP_Hacker X2SoldierClassTemplate]
DisplayName="黑客"
ClassSummary="这些士兵经过训练，能在各种不利条件下准确击中目标，他们擅长在安全距离外击败难以击中或防守严密的目标。他们拥有多种不同的方法来消灭高价值目标!"
AbilityTreeTitles[0]="破解"
AbilityTreeTitles[1]="精准"
AbilityTreeTitles[2]="专注"
AbilityTreeTitles[3]="XCOM"

;***************************************
; - GTS UNLOCKS -
;***************************************

;Hacker Unlocks
[VCP_HackerUnlocks1 X2SoldierAbilityUnlockTemplate]
DisplayName = "黑客: 黑客精通2"
Summary = "所有黑客型士兵都获得黑客精通2，不论军衔."
[VCP_HackerUnlocks2 X2SoldierAbilityUnlockTemplate]
DisplayName = "黑客: 黑客精通3"
Summary = "所有黑客型士兵都获得黑客精通3，不论军衔."
[VCP_HackerUnlocks3 X2SoldierAbilityUnlockTemplate]
DisplayName = "黑客: 黑客精通4"
Summary = "所有黑客型士兵都获得黑客精通4，不论军衔."

[GTS_VCP_Hacker1 X2SoldierAbilityUnlockTemplate]
DisplayName="黑客:风暴生成器"
Summary="将你的小精灵升级为能产生更强大的电荷。延长所有小精灵链式攻击的范围."
[GTS_VCP_Hacker2 X2SoldierAbilityUnlockTemplate]
DisplayName="黑客: 备用电池"
Summary="为你的电弧发射器装备额外电池！让你能够快速为电弧发射器充电，并将相关冷却时间最多减少3回合."
[GTS_VCP_Hacker3 X2SoldierAbilityUnlockTemplate]
DisplayName="黑客: 超低温存储"
Summary="为小精灵加装额外低温存储装置。获得额外的冻结和寒霜协议电荷."

;***************************************
;New Ability Descriptions
;***************************************

;Hacker Ability
[VCP_HackMastery X2AbilityTemplate]
LocFriendlyName = "黑客精通"
LocHelpText = "<Ability:ClassName/>随着经验的积累，其黑客攻击能力得到提升."
LocLongDescription = "<Ability:ClassName/>随着经验的积累，其黑客攻击能力得到提升."
LocPromotionPopupText = "<font color='#CA7200'>等级=1</font>获得<Ability:RANKNAME1/> rank [1]<br/><Bullet/>获得<font color='#3ABD23'>功率激增</font> - 你的小精灵技能每有20点黑客攻击值，就会造成+1点额外伤害最高60.<br/><Bullet/>搭档每完成一次任务都会额外获得黑客攻击值.<br/><Bullet/>获得+5侵入.<br/><br/><font color='#CA7200'>等级2</font>获得<Ability:RANKNAME3/> rank [3]<br/><Bullet/>获得<font color='#3ABD23'>行动协议</font> - 获得+1点行动点.<br/><Bullet/>获得+5 侵入.<br/><br/><font color='#CA7200'>等级3</font>获得<Ability:RANKNAME5/> rank [5]<br/><Bullet/>获得<font color='#3ABD23'>扩展信号范围</font> -小精灵技能都可以在小队视野范围内使用.<br/><Bullet/>获得+5 侵入.<br/><br/><font color='#CA7200'>等级四</font>获得<Ability:RANKNAME7/> rank [7]<br/><Bullet/>获得+45 侵入."

[VCP_ActionProtocol X2AbilityTemplate]
LocFriendlyName="行动协议"
LocLongDescription="为你提供+1行动点."
LocHelpText="为你提供+1行动点."
LocFlyOverText=""

[VCP_PowerSurge X2AbilityTemplate]
LocFriendlyName="功率激增"
LocLongDescription="你的小精灵技能每有20点黑客攻击值，就会造成+1点额外伤害."
LocHelpText="你的小精灵技能每有20点黑客攻击值，就会造成+1点额外伤害."
LocFlyOverText="功率激增"

[VCP_HackUnlocked X2AbilityTemplate]
LocFriendlyName="黑客熟练度"
LocLongDescription="获得+40黑客侵入值."
LocHelpText="获得+40黑客侵入值."
LocFlyOverText=""

